In [1]:
import pandas as pd
df=pd.read_csv("Book2.csv")
df

,math_score,reading score,writing score,placement score,club join year,placement offer count
0,75.0,78.0,80.0,75,2020.0,2
1,66.0,76.0,64.0,100,2018.0,3
2,66.0,82.0,67.0,75,2020.0,2
3,63.0,78.0,73.0,83,2019.0,2
4,60.0,95.0,55.0,95,2018.0,3
...,...,...,...,...,...,...
86,77.0,84.0,66.0,86,2019.0,3
87,76.0,75.0,80.0,87,2020.0,3
88,62.0,93.0,63.0,84,2018.0,2
89,68.0,90.0,69.0,86,2020.0,3
90,64.0,88.0,78.0,80,2021.0,2

In [2]:
df.isnull

<bound method DataFrame.isnull of     math_score  reading score   writing score  placement score   \
0         75.0            78.0           80.0                75
1         66.0            76.0           64.0               100
2         66.0            82.0           67.0                75
3         63.0            78.0           73.0                83
4         60.0            95.0           55.0                95
..         ...             ...            ...               ...
86        77.0            84.0           66.0                86
87        76.0            75.0           80.0                87
88        62.0            93.0           63.0                84
89        68.0            90.0           69.0                86
90        64.0            88.0           78.0                80

    club join year   placement offer count
0            2020.0                      2
1            2018.0                      3
2            2020.0                      2
3            2019.0                      2
4            2018.0                      3
..              ...                    ...
86           2019.0                      3
87           2020.0                      3
88           2018.0                      2
89           2020.0                      3
90           2021.0                      2

[91 rows x 6 columns]>

In [3]:
df.notnull

<bound method DataFrame.notnull of     math_score  reading score   writing score  placement score   \
0         75.0            78.0           80.0                75
1         66.0            76.0           64.0               100
2         66.0            82.0           67.0                75
3         63.0            78.0           73.0                83
4         60.0            95.0           55.0                95
..         ...             ...            ...               ...
86        77.0            84.0           66.0                86
87        76.0            75.0           80.0                87
88        62.0            93.0           63.0                84
89        68.0            90.0           69.0                86
90        64.0            88.0           78.0                80

    club join year   placement offer count
0            2020.0                      2
1            2018.0                      3
2            2020.0                      2
3            2019.0                      2
4            2018.0                      3
..              ...                    ...
86           2019.0                      3
87           2020.0                      3
88           2018.0                      2
89           2020.0                      3
90           2021.0                      2

[91 rows x 6 columns]>

In [4]:
df.info

<bound method DataFrame.info of     math_score  reading score   writing score  placement score   \
0         75.0            78.0           80.0                75
1         66.0            76.0           64.0               100
2         66.0            82.0           67.0                75
3         63.0            78.0           73.0                83
4         60.0            95.0           55.0                95
..         ...             ...            ...               ...
86        77.0            84.0           66.0                86
87        76.0            75.0           80.0                87
88        62.0            93.0           63.0                84
89        68.0            90.0           69.0                86
90        64.0            88.0           78.0                80

    club join year   placement offer count
0            2020.0                      2
1            2018.0                      3
2            2020.0                      2
3            2019.0                      2
4            2018.0                      3
..              ...                    ...
86           2019.0                      3
87           2020.0                      3
88           2018.0                      2
89           2020.0                      3
90           2021.0                      2

[91 rows x 6 columns]>

In [5]:
df.isnull()

,math_score,reading score,writing score,placement score,club join year,placement offer count
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
86,False,False,False,False,False,False
87,False,False,False,False,False,False
88,False,False,False,False,False,False
89,False,False,False,False,False,False
90,False,False,False,False,False,False

In [6]:
df.notnull()

,math_score,reading score,writing score,placement score,club join year,placement offer count
0,True,True,True,True,True,True
1,True,True,True,True,True,True
2,True,True,True,True,True,True
3,True,True,True,True,True,True
4,True,True,True,True,True,True
...,...,...,...,...,...,...
86,True,True,True,True,True,True
87,True,True,True,True,True,True
88,True,True,True,True,True,True
89,True,True,True,True,True,True
90,True,True,True,True,True,True

In [8]:
series = pd.isnull(df["math_score"]) 
df[series]

,math_score,reading score,writing score,placement score,club join year,placement offer count
48,NaN,83.0,67.0,80,2020.0,2
49,NaN,89.0,72.0,93,2021.0,3
50,NaN,87.0,70.0,1000,2020.0,3
51,NaN,75.0,70.0,83,2018.0,2
52,NaN,81.0,61.0,90,2020.0,3
53,NaN,79.0,76.0,77,2018.0,2

In [9]:
ndf=df

In [13]:
y=df.fillna(0)

In [15]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   math_score             91 non-null     float64
 1   reading score          91 non-null     float64
 2   writing score          91 non-null     float64
 3   placement score        91 non-null     int64
 4   club join year         91 non-null     float64
 5   placement offer count  91 non-null     int64
dtypes: float64(4), int64(2)
memory usage: 4.3 KB

In [12]:
missing_values = ["Na", "na"] 
df = pd.read_csv("Book2.csv", na_values = 
missing_values) 
df

,math_score,reading score,writing score,placement score,club join year,placement offer count
0,75.0,78.0,80.0,75,2020.0,2
1,66.0,76.0,64.0,100,2018.0,3
2,66.0,82.0,67.0,75,2020.0,2
3,63.0,78.0,73.0,83,2019.0,2
4,60.0,95.0,55.0,95,2018.0,3
...,...,...,...,...,...,...
86,77.0,84.0,66.0,86,2019.0,3
87,76.0,75.0,80.0,87,2020.0,3
88,62.0,93.0,63.0,84,2018.0,2
89,68.0,90.0,69.0,86,2020.0,3
90,64.0,88.0,78.0,80,2021.0,2